<template>
  <div class="about">
    <div class="content">
      <section data-title="Introduction" class="test-section" id="introduction">
        <Heading>Introduction</Heading>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
      </section>
      <section
        data-title="Request &amp; Response"
        class="test-section"
        id="request-response"
      >
        <Heading>Request &amp; Response</Heading>
        <p>
          В этой статье я хотел бы поделиться одним из способов уменьшить
          начальный вес веб-сайта. Я покажу как загрузить пользователю только
          видимый контент когда он/она видит первый экран и лениво загрузить
          остальные “тяжелые” элементы (такие как изображения) когда они
          понадобятся.
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Например, мы могли использовать события и функции отслеживающие
          позицию скролла, значение отступа, высоту элемента и высоту вьюпорта
          чтобы вычислить находится ли картинка в нём или нет. Звучит безумно,
          не так ли?
        </p>
      </section>
      <section
        data-title="Authentication"
        class="test-section"
        id="authentication"
      >
        <Heading>Authentication</Heading>
        <p>Чтобы это сделать, нам необходимо решить:</p>
        <p>
          Если бы нам действительно было необходимо, мы могли бы прибегнуть к
          этому решению (не важно насколько бы ужасно оно ни выглядело), но это
          бы сказалось на производительности. Такие вычисления бы производились
          при каждом событии скролла. Более того, представьте что у вас
          несколько изображений каждое из которых должно вычислить находится ли
          оно в зоне видимости или нет при каждом скролле.
        </p>
      </section>
      <section data-title="Links" class="test-section" id="links">
        <Heading>Links</Heading>
        <p>Как хранить ссылки изображений не загружая их сразу.</p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
      </section>
      <section data-title="Expanders" class="test-section" id="expanders">
        <Heading>Expanders</Heading>
        <p>
          Как определить когда изображение становится видимым (необходимым)
          пользователю и отправить за ним запрос.
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>

        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
      </section>
      <section data-title="Filters" class="test-section" id="filters">
        <Heading>Filters</Heading>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
        <p>
          Сегодня изображения (их размер и количество на отдельно взятой
          странице) могут быть главной проблемой, когда дело касается
          производительности. Учитывая что от загрузки страницы напрямую зависит
          конверсия веб-сайта, эту проблему нельзя оставлять без внимания.
        </p>
        <p>
          Если вы когда-нибудь встречались с такой задачей, вы, вероятно,
          использовали магию JavaScript’а, которая, в конце-концов выглядела
          чудовищно…
        </p>
      </section>
    </div>
    <Anchors :selector="'.test-section[id]'" />
  </div>
</template>

<script>
import { Heading, Anchors } from 'atoms'
export default {
  components: {
    Heading,
    Anchors
  }
}
</script>

<style lang="scss">
@import 'about';
</style>
